Revit 2027 API
PipingSystemType.SingleLineBendRiseType Property
 Symbol for a 1 line rise
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RiseDropSymbol SingleLineBendRiseType { get; set; }
Public Property SingleLineBendRiseType As RiseDropSymbol
	Get
	Set
public:
property RiseDropSymbol SingleLineBendRiseType {
	RiseDropSymbol get ();
	void set (RiseDropSymbol value);
}
member SingleLineBendRiseType : RiseDropSymbol with get, set
Property Value
RiseDropSymbol
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input is not a valid piping rise/drop symbol type.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace